<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Filesystem Disk
    |--------------------------------------------------------------------------
    |
    | مشخص می‌کنه که فایل‌ها کجا ذخیره بشن.
    | می‌تونی هر دیسکی که توی config/filesystems.php تعریف شده استفاده کنی
    | (مثلاً: local, public, s3).
    |
    */

    'disk' => env('MEDIAMODULE_DISK', 'public'),
    'disks' => explode(',',env('MEDIAMODULE_DISKS', 'public')),

    /*
    |--------------------------------------------------------------------------
    | Base Directory
    |--------------------------------------------------------------------------
    |
    | مسیر پایه‌ای که همه فایل‌های این پکیج توی اون ذخیره می‌شن.
    | می‌تونی تغییرش بدی تا توی یک فولدر خاص نگه‌داری بشن.
    |
    */

    'base_directory' => env('MEDIAMODULE_BASE_DIR', 'lhaamed'),

];
